Revit 2024 API
Checker Class
 A static class that provides access to the property names that appear in the Checker visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Checker
Visual Basic
Public NotInheritable Class Checker
Visual C++
public ref class Checker abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Checker
See Also
Checker Members
Autodesk.Revit.DB.Visual Namespace